{
  "lang": "cz",
  "meta": {
    "description": "Osobní webové stránky pro prezentaci"
  },
  "article_header": {
    "buttons": {
      "button_themes_aria_label": "Při kliknutí se změní barevný režim",
      "icon_light_theme_alt": "Ikona světlého režimu",
      "icon_dark_theme_alt": "Ikona tmavého režimu",
      "button_lang_aria_label": "Při kliknutí se změní jazyk, v kterém je obsah stránky napsán",
      "icon_lang_en_alt": "Ikona vlajky Velké Británie",
      "icon_lang_cz_alt": "Ikona vlajky České Republiky"
    },
    "logo_alt": "Logo",
    "menu": {
      "icon_alt": "Ikona menu, při kliknutí, nebo přejetí se rozbalí nabídka menu",
      "education": "VZDĚLÁNÍ",
      "techstack": "TECHSTACK",
      "contact": "KONTAKT"
    }
  },
  "article_hero": {
    "main": {
      "name": "ADAM BARTŮŠEK,",
      "proffesion": "SOFTWARE\nENGINEER",
      "level": "Junior level"
    },
    "profile_picture_alt": "Profilová fotka, Adam Bartůšek"
  },
  "article_education": {
    "aside": "V\nZ\nD\nĚ\nL\nÁ\nN\nÍ",
    "main": [
      {
        "title": "Střední škola",
        "content": "Pominu-li 2. stupeň v matematické třídě, tak můj zájem k technickým oborům a IT začal na Střední škole elektrotechnické v Pardubicích (SPŠE), kde jsem studoval Komunikační technologie. Právě tady jsem se poprvé setkal s programováním, nejvíce s backendem (Java) a mikroprocesorovou technikou (Arduino), ale také trochu s frontendem, tedy tvorbou webů a webových aplikací."
      },
      {
        "title": "Univerzita",
        "content": "Pro své další studium jsem si vybral UHK, fakultu FIM, obor Informační management. Aktuálně studuji bakalářské studium a plánuji pokračovat na magisterské ve stejném oboru. I zde jsem se přiblížil k programování (html, css, javascript, java a práce s databázemi). Znalosti získané s povinných předmětů mi úplně nestačili a proto jsem se začal učit ve volném čase sám."
      },
      {
        "title": "Sebevzdělání",
        "content": "Nejprve jsem se chtěl seznámit s backendem, protože mě zajímalo jak to všechno funguje, proto jsem se rok učil python. Poté jsem si chtěl alespoň trochu doplnit znalosti z front-endu a umět full-stack, ale u front-endu jsem nakonec zůstal a poslední rok se v něm snažím zlepšovat. Primárně se snažím zlepšovat v reactu/nextu a psát kvalitní čitelný kód."
      }
    ]
  },
  "article_techstack": {
    "aside": "T\nE\nC\nH\nS\nT\nA\nC\nK",
    "main": [
      {
        "title": "HTML5, CSS3 & Sass",
        "content": "S HTML i CSS jsem se setkal již na základní škole a dnes je pro mě samozřejmostí oboje. Poslední dobou se s čistým HTML ani CSS nesetkávám. HTML píšu skrze JSX v Reactu a spíše než obyčejné CSS využívám preprocesor scss/sass. Ve všech třech kurzech souvisejících s programování bylo HTML i CSS, od základů až do pokročilých principů.",
        "projects": {
          "title": "PROJEKTY",
          "content": "10+"
        }
      },
      {
        "title": "Javascript",
        "content": "Javascript je pro mě další ze základů, i když jsem se s ním setkal spíše až ke konci střední školy/začátku vysoké. V obouch kurzech zaměřených na front-end jsem se javascript učil, takže jazyk jako takový znám a rozumím mu. Nejspíše jsem se až moc rychle pustil do frameworku (React) a proto se stále ještě určité pricipy javascriptu učím za pochodu.",
        "projects": {
          "title": "PROJEKTY",
          "content": "5"
        }
      },
      {
        "title": "React",
        "content": "Rozhodování mezi frameworky React a Angular pro mě bylo trochu složitější, ale nakonec jsem zvolil React a zpětně mi to přijde jako skvělá volba. Poprvé jsem se s Reactem setkal ve svém první FrontEnd kurzu a ještě než jsem ho kompletně dodělal, pořídil jsem kurz specializovaný na React, Redux a Typescript, který jestě dodělávám, protože nyní čas věnuji spíše reálným projektům.",
        "projects": {
          "title": "PROJEKTY",
          "content": "2"
        }
      },
      {
        "title": "Next.js",
        "content": "Next.js pro mě nebyl až tak jednoznačnou volbou hlavně kvůli Pages router, který mi není zdaleka tak sympatický jako poměrně nový App router, ale jakmile se uvedl do provozu a už není jen v 'testovací verzi' tak začal využívat pouze Next a rád bych v něm pokračoval, i když samozřejmě nemám problém se naučit i jiný framework.",
        "projects": {
          "title": "PROJEKTY",
          "content": "2"
        }
      },
      {
        "title": "Git & GitHub",
        "content": "Git a GitHub jsou pro mě určite základy a s Control Version se snažím pracovat na denní bázi, vždy každou úpravu kódu mít aktivně na githubu. Vím, že v každé firmě se s GitHubem pracuje a proto považuji tuto dovednost za nezbytnou. Git a GitHub jsem měl ve všech třech kurzech a setkávám se s tím v každém projektu a videu z kterých se učím.",
        "projects": {
          "title": "PROJEKTY",
          "content": "10+"
        }
      },
      {
        "title": "Python",
        "content": "Původně jsem v pythonu viděl svoji programátorskou budoucnost, ale po větším poznání front-endu mě zaujalo dělat spíše něco co je více vidět. I přesto jsem měl Python velice rád a absolvoval jsem celý 100 denní kurz na Udemy, který mi trval skoro rok. V kurzu jsem se dostal od hry hangman, přes práci s knihovnami (NumPy, Matplotlib, SciPy, atd.), až po základy AI.",
        "projects": {
          "title": "PROJEKTY",
          "content": "10+"
        }
      }
    ],
    "alts": {
      "html": "HTML5 Ikona",
      "css": "CSS3 Ikona",
      "sass": "Sass Ikona",
      "js": "Javascript Ikona",
      "react": "React Ikona",
      "nextjs": "NextJs Ikona",
      "git": "Git Ikona",
      "github": "GitHub Ikona",
      "python": "Python Ikona",
      "figma": "Figma Ikona",
      "ts": "Typescript Ikona"
    }
  },
  "article_contact": {
    "aside": "K\nO\nN\nT\nA\nK\nT",
    "main": {
      "job_demand": {
        "title": "Co hledám",
        "content": {
          "1": {
            "title": "POLOVIČNÍ ÚVAZEK",
            "description": "Rád bych našel práci na poloviční úvazek, kvůli studiu"
          },
          "2": {
            "title": "SEBEROZVOJ",
            "description": "Hledám práci v které budu moci stále zlepšovat své dosavadní dovednosti a učit se novým věcem"
          },
          "3": {
            "title": "DLOUHODOBÁ SPOLUPRÁCE",
            "description": "Nehledám firmu, kde se ohřeji na pár měsíců, ale rád bych stabilní zázemí"
          },
          "4": {
            "title": "HYBRID",
            "description": "Rád bych našel práci s možností dojíždění do kanceláře, kde budu mít možnost pochytit know-how od senior kolegů, ale zároveň mít do budoucna možnost úplného remote"
          }
        }
      },
      "contact": {
        "phone": "+420778033073",
        "email": "yourprogrammeradam\n@gmail.com",
        "link_github": "https://github.com/adambprograming",
        "link_linkedin": "https://www.linkedin.com/in/adam-bart%C5%AF%C5%A1ek-251107286/?locale=cs_CZ",
        "alts": {
          "phone": "Ikona Telefonu",
          "email": "Ikona E-mailu",
          "link_github": "Ikona GitHubu",
          "link_linkedin": "Ikona Linkedinu"
        }
      }
    }
  },
  "article_footer": {
    "copyright": "Copyright © 2023 Adam Bartůšek. Všechna práva vyhrazena."
  }
}
